In [26]:
import mysql.connector

mydb = mysql_connection = mysql.connector.connect(
    host="localhost",
    user="root",
    passwd="1234",
    database="testdb"
)

In [27]:
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000001F1B0AD8128>

In [28]:
mycursor = mydb.cursor()

In [29]:
#mycursor.execute("CREATE DATABASE testdb")

In [30]:
"""mycursor.execute("SHOW DATABASES")
for db in mycursor:
    print(db)"""

'mycursor.execute("SHOW DATABASES")\nfor db in mycursor:\n    print(db)'

In [31]:
#mycursor.execute("CREATE TABLE students(name VARCHAR(255), age INTEGER(10))")

In [32]:
mycursor.execute("SHOW TABLES")
for tb in mycursor:
    print(tb)

('students',)

In [33]:
#sqlformula = "INSERT INTO students (name, age) VALUES(%s,%s)"
#student1= ("Rachel",22)

In [34]:
#mycursor.execute(sqlformula, student1)

In [35]:
#mydb.commit()

In [36]:
#sqlformula = "INSERT INTO students (name, age) VALUES(%s,%s)"

In [37]:
"""students= [("Ilsa",23),
          ("Hamza Rao",23),
          ("Abid",22),
          ("Irfan",21),
          ("Maryam",20),
          ("Wisha",22),
          ("Mahnoor",21),]"""

'students= [("Ilsa",23),\n          ("Hamza Rao",23),\n          ("Abid",22),\n          ("Irfan",21),\n          ("Maryam",20),\n          ("Wisha",22),\n          ("Mahnoor",21),]'

In [38]:
#mycursor.executemany(sqlformula, students)

In [39]:
#mydb.commit()

In [40]:
mycursor.execute("SELECT * FROM students")

In [41]:
result = mycursor.fetchall()

In [42]:
for r in result:
    print(r)

('Rachel', 22)
('Ilsa', 23)
('Hamza Rao', 23)
('Abid', 22)
('Irfan', 21)
('Maryam', 20)
('Wisha', 22)
('Mahnoor', 21)
('Ilsa', 23)
('Hamza Rao', 23)
('Abid', 22)
('Irfan', 21)
('Maryam', 20)
('Wisha', 22)
('Mahnoor', 21)
('Ilsa', 23)
('Hamza Rao', 23)
('Abid', 22)
('Irfan', 21)
('Maryam', 20)
('Wisha', 22)
('Mahnoor', 21)

In [43]:
#mycursor.execute("SELECT age FROM students")

In [44]:
result = mycursor.fetchall()

In [45]:
for r in result:
    print(r)

In [46]:
mycursor.execute("SELECT age FROM students")
result = mycursor.fetchone()
for r in result:
    print(r)

22

In [60]:
mycursor.fetchall()
mycursor.close()

True

In [61]:
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM students WHERE name='Irfan'")

In [62]:
result = mycursor.fetchall()

In [63]:
for r in result:
    print(r)

('Irfan', 21)
('Irfan', 21)
('Irfan', 21)

In [64]:
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM students ORDER BY name DESC")
result = mycursor.fetchall()
for r in result:
    print(r)
mycursor.close()

('Wisha', 22)
('Wisha', 22)
('Wisha', 22)
('Rachel', 22)
('Maryam', 20)
('Maryam', 20)
('Maryam', 20)
('Mahnoor', 21)
('Mahnoor', 21)
('Mahnoor', 21)
('Irfan', 21)
('Irfan', 21)
('Irfan', 21)
('Ilsa', 23)
('Ilsa', 23)
('Ilsa', 23)
('Hamza Rao', 23)
('Hamza Rao', 23)
('Hamza Rao', 23)
('Abid', 22)
('Abid', 22)
('Abid', 22)

In [67]:
mycursor = mydb.cursor()
mycursor.execute("UPDATE students SET age=13 WHERE name='Rachel'")
mycursor.execute("SELECT * FROM students WHERE name='Rachel'")
result = mycursor.fetchall()
for r in result:
    print(r)
mycursor.close()

('Rachel', 13)

True

In [68]:
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM students LIMIT 5")
result = mycursor.fetchall()
for r in result:
    print(r)
mycursor.close()

('Rachel', 13)
('Ilsa', 23)
('Hamza Rao', 23)
('Abid', 22)
('Irfan', 21)

True

In [69]:
mycursor = mydb.cursor()
mycursor.execute("DELETE FROM students WHERE name='Rachel'")
mydb.commit()

In [71]:
mycursor = mydb.cursor()
mycursor.execute("DELETE FROM students WHERE age=21")
mydb.commit()

In [72]:
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM students")
result = mycursor.fetchall()
for r in result:
    print(r)
mycursor.close()

('Ilsa', 23)
('Hamza Rao', 23)
('Abid', 22)
('Maryam', 20)
('Wisha', 22)
('Ilsa', 23)
('Hamza Rao', 23)
('Abid', 22)
('Maryam', 20)
('Wisha', 22)
('Ilsa', 23)
('Hamza Rao', 23)
('Abid', 22)
('Maryam', 20)
('Wisha', 22)

True